---
type: SymbolicCurveArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# SymbolicCurveArray

`Autodesk.Revit.DB.SymbolicCurveArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SymbolicCurveArray | — | `public SymbolicCurveArray ()` |
| Method | Append | — | `public virtual void Append ( SymbolicCurve item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual SymbolicCurveArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( SymbolicCurve item , int index )` |
| Method | ReverseIterator | — | `public virtual SymbolicCurveArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual SymbolicCurve this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |